gokugoku-kun/rx72t_dataflash_test/firm/src/r_datfrx_rx/r_datfrx_rx/src/r_flash_dm_rx_if.c
/************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2018(2024) Renesas Electronics Corporation. All rights reserved.
*************************************************************************************************/
/************************************************************************************************
* File Name    : r_flash_dm_rx_if.c
* Version      : 2.30
* Description  : DATFRX interface source file
*************************************************************************************************/
/************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 28.09.2018 2.00     First Release
*              : 25.01.2019 2.01     English PDF added, Fixed blank check processing and Busy check procedure
*              : 21.04.2023 2.10     Added macro constant judgment of "FLASH_TYPE_5"
*              : 14.03.2024 2.30     Delete the following macro judgments.
*                                    "FLASH_CFG_CODE_FLASH_ENABLE"
*                                    "FLASH_CFG_CODE_FLASH_BGO"
*************************************************************************************************/

/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
#include "r_flash_dm_rx_if.h"
#include "r_flash_dm_private.h"

#if(FLASH_TYPE == FLASH_TYPE_1)
#include "r_dispatch_1.h"
#else
#include "r_dispatch_2.h"
#endif

/************************************************************************************************
Macro definitions
*************************************************************************************************/

/************************************************************************************************
Local Typedef definitions
*************************************************************************************************/

/************************************************************************************************
Exported global functions (to be accessed by other files)
*************************************************************************************************/

/************************************************************************************************
Private global variables and functions
*************************************************************************************************/
/* narrow APIs*/
#if(FLASH_TYPE == FLASH_TYPE_1)
static e_flash_dm_status_t r_flash_dm_d1_init(void);
static e_flash_dm_status_t r_flash_dm_d1_read(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d1_write(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d1_erase(void);
static e_flash_dm_status_t r_flash_dm_d1_control(e_flash_dm_cmd_t cmd, uint32_t* pcfg);
static e_flash_dm_status_t r_flash_dm_d1_format(void);
static e_flash_dm_status_t r_flash_dm_1_get_writable_size(uint32_t* pcfg);

static st_flash_dispatch_1_hndl_t* (g_flash_dm_handle);

#else /* FLASH_TYPE == FLASH_TYPE_2 || FLASH_TYPE == FLASH_TYPE_3 || FLASH_TYPE == FLASH_TYPE_4 || FLASH_TYPE == FLASH_TYPE_5 */
static e_flash_dm_status_t r_flash_dm_d2_init(void);
static e_flash_dm_status_t r_flash_dm_d2_read(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d2_write(st_flash_dm_info_t * p_flash_dm_info);
static e_flash_dm_status_t r_flash_dm_d2_erase(void);
static e_flash_dm_status_t r_flash_dm_d2_control(e_flash_dm_cmd_t cmd, uint32_t* pcfg);
static e_flash_dm_status_t r_flash_dm_d2_format(void);
static e_flash_dm_status_t r_flash_dm_2_get_writable_size(uint32_t*);

static st_flash_dispatch_2_hndl_t* (g_flash_dm_handle);
#endif/* FLASH_TYPE */

/* common APIs */
static e_flash_dm_status_t r_flash_dm_get_writable_size(uint32_t*);
static e_flash_dm_status_t r_flash_dm_getactivity(uint32_t*);
static e_flash_dm_status_t r_flash_dm_getdatasize(uint32_t*);
static e_flash_dm_status_t r_flash_dm_getdatanum(uint32_t*);
static uint8_t r_flash_dm_drvif_close(void);

#if(FLASH_TYPE == FLASH_TYPE_2)
extern void r_flash_dm_disable_rw(void);
extern void r_flash_dm_enable_rw(void);
#endif

/* user callback */
p_flash_dm_callback r_flash_dm_callbackfunc;

/***************************************************************************************************
* Function Name: R_FLASH_DM_Open
* Description  : Initializes the DATFRX work memory.
* Arguments    : uint32_t * p_flash_dm_work ; Work memory
*              : p_flash_dm_callback func   ; Callback function for end processing
*              :                            ; Processing are format, write, erase, reclaim and error.
* Return Value : FLASH_DM_SUCCESS           ; Successful operation.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_OPEN          ; Failed operation of driver interface/
*--------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, must place the source code to the ROM.
*              : (Prohibit the placement to RAM)
***************************************************************************************************/
e_flash_dm_status_t R_FLASH_DM_Open(uint32_t* p_flash_dm_work, p_flash_dm_callback func)
{
    uint32_t * p_ptr = 0;
    uint32_t i = 0;
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;

