gokugoku-kun/rx72t_dataflash_test/firm/src/r_datfrx_rx/r_datfrx_rx/src/r_flash_dm_rx_if.c
    /* ==== Check the parameter. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_ERASE;
    }
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        /* ==== Check status. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_ERASE_1ST_CHECK);

        if((FLASH_DM_ERR_BUSY != ret) && (FLASH_DM_ERR_REQUEST_INIT != ret))
        {
            /* ==== Detect the erase block. ==== */
            if (0 == g_flash_dm_handle->p_reclaim)
            {
                ret = FLASH_DM_NO_INVALID_BLOCK;
            }
            else if ((FLASH_DM_BLOCK_STATUS_GARBAGE != g_flash_dm_handle->p_reclaim->stat) &&
                     (FLASH_DM_BLOCK_STATUS_ERROR_GARBAGE != g_flash_dm_handle->p_reclaim->stat))
            {
                ret = FLASH_DM_NO_INVALID_BLOCK;
            }
            else if(g_flash_dm_handle->flash_state == DATF_FLASH_CALL)
                /* === Check if this module is processing callback. === */
            {
                ret = FLASH_DM_ERR_BUSY;
            }
            else
            {
                /* ==== Start to erase of the block. ==== */
                uc_tmp = (g_flash_dm_handle->activity | FLASH_DM_ACT_ERASING);
                g_flash_dm_handle->activity = uc_tmp;
                ret = r_flash_dm_dispatch(FLASH_DM_USER_ERASE_SETUP);
            }
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d1_erase() */

/************************************************************************************************
* Function Name: r_flash_dm_d1_format
* Description  : Formats the device.
* Arguments    : none
* Return Value : FLASH_DM_ACCEPT            ; Successful operation reception.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d1_format(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    /* ==== Check the parameter. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_FORMAT;
    }
    /* ==== Check busy. ==== */
    else if (g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        /* === Check if this module is processing callback. === */
        if(g_flash_dm_handle->flash_state == DATF_FLASH_CALL)
        {
            ret = FLASH_DM_ERR_BUSY;
        }
        /* ==== Start to erase of the block. ==== */
        else
        {
            ret = r_flash_dm_dispatch(FLASH_DM_FORMAT_SETUP);
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d1_format() */

/************************************************************************************************
* Function Name: r_flash_dm_d1_control
* Description  : Define various functions.
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS           ; Successful operation and no erase block.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR               ; Failed operation.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d1_control(e_flash_dm_cmd_t cmd, uint32_t* pcfg)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;

    if ( NULL == pcfg)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    else
    {
        switch (cmd)
        {
            case FLASH_DM_GET_WRITABLE_SIZE:
            {
                ret = r_flash_dm_get_writable_size(pcfg);
            }
            break;

            case FLASH_DM_GET_STATUS:
            {
                ret = r_flash_dm_getactivity(pcfg);
            }
            break;

            case FLASH_DM_GET_DATA_SIZE:
            {
                ret = r_flash_dm_getdatasize(pcfg);
            }
            break;

            case FLASH_DM_GET_DATA_NUM:
            {
                ret = r_flash_dm_getdatanum(pcfg);
            }
            break;

            default:
            {
                ret = FLASH_DM_ERR_ARGUMENT;
            }
            break;
        }
    }

    return ret;
} /* End of function r_flash_dm_d1_control() */

/************************************************************************************************
* Function Name: r_flash_dm_1_get_writable_size
* Description  : Acquires the size of free space
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS           ; Successful operation and no erase block.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR               ; Failed operation.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_1_get_writable_size(uint32_t* pcfg)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    int16_t writable_size;
    uint8_t tmp = g_flash_dm_handle->api_call;

    if (0 == g_flash_dm_handle)
    {
        return FLASH_DM_ERR_ARGUMENT;
    }

