gokugoku-kun/rx72t_dataflash_test/firm/src/r_datfrx_rx/r_datfrx_rx/src/r_flash_dm_rx_if.c
    if ( NULL == pcfg)
    {
        return FLASH_DM_ERR_ARGUMENT;
    }

    if (g_flash_dm_handle->activity == FLASH_DM_ACT_IDLE)
    {
        /* ==== Check status. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_WRITABLE_SIZE_1ST_CHECK);
        if (FLASH_DM_SUCCESS == ret)
        {
            /* ==== Get free area.  ==== */
            writable_size = r_flash_dm_free_area();
            if (writable_size <= 0)
            {
                ret = FLASH_DM_ERR;
            }
            else
            {
                *pcfg = (uint32_t)writable_size;
            }
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_1_get_writable_size() */

#else /* FLASH_TYPE */
/************************************************************************************************
* Function Name: r_flash_dm_d2_init
* Description  : Initializes the device.
* Arguments    : None
* Return Value : FLASH_DM_ADVANCE               ; Successful operation, call advanced function.
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_REQUEST_INIT      : Failed operation and request initialization.
*              : FLASH_DM_ERR_INIT              ; Failed operation of Initialize.
*------------------------------------------------------------------------------------------------
* Notes        : Always, Place the source code to the ROM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d2_init(void)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    /* ==== Handle Check ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_INIT;
    }
    /* ==== Check Busy. ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        g_flash_dm_handle->activity = FLASH_DM_ACT_INITIALIZING;
        /* cast from uint16_t to uint16_t */
        ret = r_flash_dm_1st_check(FLASH_DM_INIT_1ST_CHECK);

        if((FLASH_DM_ERR_BUSY != ret) && (FLASH_DM_ERR_REQUEST_INIT != ret))
        {
            g_flash_dm_handle->initialized = 0u;
            ret = r_flash_dm_init_set();
        }
    }
    g_flash_dm_handle->activity = FLASH_DM_ACT_IDLE;
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d2_init() */

/************************************************************************************************
* Function Name: r_flash_dm_d2_read
* Description  : Reads data from the device.
* Arguments    : st_flash_dm_info_t * p_flash_dm_info
*              :    uint8_t     data_no         ; The data no.
*              :    uint8_t   * p_data          ; Pointer to read data buffer
* Return Value : FLASH_DM_SUCCESS               ; Successful operation.
*              : FLASH_DM_ERR_ARGUMENT          ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*              : FLASH_DM_ERR_DATA_NOT_PRESENT  ; Failed operation of the data no. to support.
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d2_read(st_flash_dm_info_t * p_flash_dm_info)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

    /* ==== Check the parameter. ==== */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    /* ==== Check the data_no and p_data. ==== */
    else if ((p_flash_dm_info->data_no >= r_flash_dm_drvif_get_datanum()) ||
             (0 == p_flash_dm_info->p_data))
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    else
    {
        /* ==== Check Busy. ==== */
        if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
        {
            ret = FLASH_DM_ERR_BUSY;
        }
        else
        {
            /* ==== Check Status. ==== */
            ret = r_flash_dm_1st_check(FLASH_DM_READ_1ST_CHECK);

            if((FLASH_DM_ERR_BUSY != ret) && (FLASH_DM_ERR_REQUEST_INIT != ret))
            {
                /* ==== cast from uint8_t to uint8_t ==== */
                if(g_flash_dm_handle->initialized != FLASH_DM_INITIALIZED_ID)
                {
                    /* ==== This module checks whether initialization has been done. ==== */
                    g_flash_dm_handle->error_code = FLASH_DM_ERR_REQUEST_INIT;
                    ret = FLASH_DM_ERR_REQUEST_INIT;
                }
                else if (g_flash_dm_handle->data_info[p_flash_dm_info->data_no] == 0xFFFF)
                {
                    ret = FLASH_DM_ERR_DATA_NOT_PRESENT;
                }
                else
                {
                    /* ==== Start processing. ==== */
                    r_flash_dm_drvif_read(p_flash_dm_info);
                }
            }
        }
    }
    g_flash_dm_handle->api_call = tmp;
    return ret;
} /* End of function r_flash_dm_d2_read() */

/************************************************************************************************
* Function Name: r_flash_dm_d2_write
* Description  : Writes data to the device.
* Arguments    : st_flash_dm_info_t * p_flash_dm_info
*              :    uint8_t         data_no     ; The data no.
*              :    uint8_t       * p_data      ; Pointer to write data buffer.
* Return Value : FLASH_DM_ACCEPT                ; Successful operation reception.
*              : FLASH_DM_ERR_REQUEST_INIT      ; Failed operation and request initialization.
*              : FLASH_DM_ERR_ARGUMENT          ; Failed operation of parameter.
*              : FLASH_DM_ERR_REQUEST_ERASE     ; Failed operation and request erase.(TYPE,2,3,4)
*              : FLASH_DM_ERR_BUSY              ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_d2_write(st_flash_dm_info_t * p_flash_dm_info)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;
    int16_t free = 0;

    /* === Check the parameter. === */
    if (0 == g_flash_dm_handle)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    /* === Check the data_no and p_data. === */
    else if ((p_flash_dm_info->data_no >= r_flash_dm_drvif_get_datanum()) ||
             (0 == p_flash_dm_info->p_data))
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    /* ==== Check busy. ==== */
    else if(g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        /* ==== Check status. ==== */
        ret = r_flash_dm_1st_check(FLASH_DM_WRITE_1ST_CHECK);

