gokugoku-kun/rx72t_dataflash_test/firm/src/r_datfrx_rx/r_datfrx_rx/src/r_flash_dm_rx_if.c
    if ( NULL == pcfg)
    {
        ret = FLASH_DM_ERR_ARGUMENT;
    }
    else
    {
        switch (cmd)
        {
            case FLASH_DM_GET_WRITABLE_SIZE :
            {
                ret = r_flash_dm_get_writable_size(pcfg);
            }
            break;

            case FLASH_DM_GET_STATUS :
            {
                ret = r_flash_dm_getactivity(pcfg);
            }
            break;

            case FLASH_DM_GET_DATA_SIZE :
            {
                ret = r_flash_dm_getdatasize(pcfg);
            }
            break;

            case FLASH_DM_GET_DATA_NUM :
            {
                ret = r_flash_dm_getdatanum(pcfg);
            }
            break;

            default:
            {
                ret = FLASH_DM_ERR_ARGUMENT;
            }
            break;
        }
    }

    return ret;
} /* End of function r_flash_dm_d2_control() */

/************************************************************************************************
* Function Name: r_flash_dm_2_get_writable_size
* Description  : Acquires the size of free space
* Arguments    : None
* Return Value : FLASH_DM_SUCCESS           ; Successful operation and no erase block.
*              : FLASH_DM_ERR_REQUEST_INIT  ; Failed operation and request initialization.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*              : FLASH_DM_ERR               ; Failed operation.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_2_get_writable_size(uint32_t* pcfg)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;

    if ( NULL == pcfg)
    {
        return FLASH_DM_ERR_ARGUMENT;
    }

    if (g_flash_dm_handle->api_call == DATF_API_CALL)
    {
        ret = FLASH_DM_ERR_BUSY;
    }
    else
    {
        g_flash_dm_handle->api_call = DATF_API_CALL;
        /* cast from uint8_t to uint8_t */
        if ((g_flash_dm_handle->activity != FLASH_DM_ACT_IDLE) || (g_flash_dm_handle->flash_state != DATF_FLASH_IDLE))
        {
            ret = FLASH_DM_ERR_BUSY;
        }
        /* cast from uint8_t to uint8_t */
        else if (g_flash_dm_handle->initialized != FLASH_DM_INITIALIZED_ID)
        {
            ret = FLASH_DM_ERR_REQUEST_INIT;
        }
        else
        {
            if(g_flash_dm_handle->erase_block_num == 1)
            {
                *pcfg = 0;
            }
            else
            {
                /* cast from uint16_t to uint16_t */
                *pcfg = (int16_t)(((g_flash_dm_handle->erase_block_num - 2) * DATF_F2_DATASIZE) + DATF_F1_DATASIZE);
            }
        }
        g_flash_dm_handle->api_call = DATF_API_IDLE;
    }
    return ret;
} /* End of function r_flash_dm_2_get_writable_size() */

#endif/* #define FLASH_TYPE */

/* common co-api area. */
/************************************************************************************************
* Function Name: r_flash_dm_drvif_close
* Description  : Close the driver interface.
* Arguments    : None
* Return Value : 1: Successful operation
*              : 0: Error
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash, must place the source code to the ROM.
*              : (Prohibit the placement to RAM)
*************************************************************************************************/
static uint8_t r_flash_dm_drvif_close(void)
{
    if(R_FLASH_Close() != FLASH_SUCCESS)
    {
        return 0;
    }
    return 1;
} /* End of function r_flash_dm_drvif_close() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_get_datanum
* Description  : Gets the number of data.
* Arguments    : None
* Return Value : The number of data
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint32_t r_flash_dm_drvif_get_datanum(void)
{
    /* cast from uint32_t to uint8_t */
    return FLASH_DM_CFG_DF_DATA_NUM;
} /* End of function r_flash_dm_drvif_get_datanum() */

/************************************************************************************************
* Function Name: r_flash_dm_drvif_get_datasize
* Description  : Gets the data size.
* Arguments    : uint8_t    data_no     ; The data no.
* Return Value : The data size of the number of the data
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint16_t r_flash_dm_drvif_get_datasize(uint32_t data_no)
{
    return gc_dm_data_size[data_no];
} /* End of function r_flash_dm_drvif_get_datasize() */

/************************************************************************************************
* Function Name: r_flash_dm_getdatasize
* Description  : Gets the data size.
* Arguments    : uint32_t    data_no     ; The data no.
* Return Value : FLASH_DM_SUCCESS           ; Successful operation and no erase block.
*              : FLASH_DM_ERR_ARGUMENT      ; Failed operation of parameter.
*              : FLASH_DM_ERR_BUSY          ; Failed operation of busy.
*------------------------------------------------------------------------------------------------
* Notes        : If control the code flash and BGO operation, place the source code to the RAM.
*************************************************************************************************/
static e_flash_dm_status_t r_flash_dm_getdatasize(uint32_t* data_no)
{
    e_flash_dm_status_t ret = FLASH_DM_SUCCESS;
    uint8_t tmp = g_flash_dm_handle->api_call;

